"""This file represents strings constants"""

WELOCOME = """Привет! Давай познакомимся! Отправь мне своё имя:"""
MAIN_MENU = """Главное меню"""

# REGISTRATION
REGISTRATION_FIRST_NAME_ENTERED = """Спасибо. Теперь введи свою фамилию:"""
REGISTRATION_BIO_ENTERED = """Супер! Теперь выбери свой пол:"""
REGISTRATION_LAST_NAME_ENTERED = """Теперь напиши краткое описание о себе:"""
REGISTRATION_GENDER_ENTERED = """Отлично! Теперь поделись, пожалуйста, своей геолокацией,\
    чтобы я мог составлять маршрут из твоего города:"""
REGISTRATION_VALID_COUNTRY_ENTERED = (
    """Супер! Напиши свой возраст:"""
)
REGISTRATION_INVALID_COUNTRY_ENTERED = """Ты отправил что-то не то. Воспользуйся кнопками. \
    Поделись, пожалуйста, своей геолокацией, чтобы я мог составлять маршруту из твоего города:"""
REGISTRATION_INTEREST_ENTERED = """Выбери еще интересы или нажми \"Завершить\""""
REGISTRATION_VALID_AGE_ENTERED = (
    """Теперь выбери свои интересы:"""
)
REGISTRATION_INVALID_AGE_ENTERED = (
    """Ты ввёл некорректный возраст, пожалуйста, введи заново"""
)
INTERESTS = [
    "Природа",
    "История",
    "Архитектура",
    "Искусство",
    "Музыка",
    "Активный спорт",
    "Пеший туризм",
    "Велотуризм",
    "Автотуризм",
    "Экстримальный спорт",
    "Животные",
    "Рыбалка",
]
END_REGISTRATION = """Спасибо! Рад знакомству! Чтобы перейти в \
    главное меню нажми сюда: /main_menu"""
